# 프로그래머스/카펫

# 제출
def solution(brown, yellow):
    cnt = 1
    while 1:
        if brown/2 == ((yellow/cnt)+2)+cnt:
            answer = [(yellow/cnt)+2, cnt+2]
            break
        cnt += 1
    return answer


# 정확성  테스트
# 테스트 1 〉	통과 (0.00ms, 10.2MB)
# 테스트 2 〉	통과 (0.01ms, 10.2MB)
# 테스트 3 〉	통과 (0.15ms, 10.3MB)
# 테스트 4 〉	통과 (0.00ms, 10.2MB)
# 테스트 5 〉	통과 (0.00ms, 10.2MB)
# 테스트 6 〉	통과 (0.06ms, 10.2MB)
# 테스트 7 〉	통과 (0.12ms, 10.2MB)
# 테스트 8 〉	통과 (0.15ms, 10.2MB)
# 테스트 9 〉	통과 (0.14ms, 10.3MB)
# 테스트 10 〉	통과 (0.18ms, 10.2MB)
# 테스트 11 〉	통과 (0.00ms, 10.2MB)
# 테스트 12 〉	통과 (0.00ms, 10.3MB)
# 테스트 13 〉	통과 (0.00ms, 10.1MB)
# 채점 결과
# 정확성: 100.0
# 합계: 100.0 / 100.0